In [40]:
import pandas as pd
import numpy as np

# Replace Empty Values     :   fillna
# The fillna() method allows us to replace empty cells with a value:

The history saving thread hit an unexpected error (OperationalError('database or disk is full')).History will not be written to the database.

In [29]:
data={"name":["roshani","savi",np.nan,"ankush","nikita"],"age":[12,23,34,45,np.nan],"salary":[2000,np.nan,4000,5000,6000]}

In [30]:
d=pd.DataFrame(data)
d

      name   age  salary
0  roshani  12.0  2000.0
1     savi  23.0     NaN
2      NaN  34.0  4000.0
3   ankush  45.0  5000.0
4   nikita   NaN  6000.0

In [31]:
d.fillna("empty")

      name    age  salary
0  roshani   12.0  2000.0
1     savi   23.0   empty
2    empty   34.0  4000.0
3   ankush   45.0  5000.0
4   nikita  empty  6000.0

In [32]:
d.fillna("empty",inplace=True)

C:\Users\Quastech\AppData\Local\Temp\ipykernel_8184\3875811675.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'empty' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  d.fillna("empty",inplace=True)

In [12]:
d

      name    age  salary
0  roshani   12.0  2000.0
1     savi   23.0   empty
2    empty   34.0  4000.0
3   ankush   45.0  5000.0
4   nikita  empty  6000.0

In [33]:
# Replace Only For Specified Columns

d.fillna({"salary":9000},inplace=True)

In [34]:
d

      name    age  salary
0  roshani   12.0  2000.0
1     savi   23.0   empty
2    empty   34.0  4000.0
3   ankush   45.0  5000.0
4   nikita  empty  6000.0

In [23]:
# Replace Only For Specified Columns

d.fillna({"name":"sakshi"},inplace=True)

In [24]:
d

      name   age  salary
0  roshani  12.0  2000.0
1     savi  23.0  9000.0
2   sakshi  34.0  4000.0
3   ankush  45.0  5000.0
4   nikita   NaN  6000.0

In [26]:
# Replace Only For Specified Columns

d.fillna({"age":21},inplace=True)

In [27]:
d

      name   age  salary
0  roshani  12.0  2000.0
1     savi  23.0  9000.0
2   sakshi  34.0  4000.0
3   ankush  45.0  5000.0
4   nikita  21.0  6000.0

In [35]:
#  method : ffill  or  bfill 

d.fillna(method="ffill",inplace=True)

C:\Users\Quastech\AppData\Local\Temp\ipykernel_8184\231248917.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d.fillna(method="ffill",inplace=True)

In [37]:
d.fillna(method="bfill",inplace=True)

C:\Users\Quastech\AppData\Local\Temp\ipykernel_8184\1665572115.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d.fillna(method="bfill",inplace=True)

In [39]:
data={"name":["mansi","rakesh","rani",np.nan],"surname":["mane","salekar",np.nan,"gadage"],"age":[20,np.nan,43,23]}
s=pd.DataFrame(data)
s

     name  surname   age
0   mansi     mane  20.0
1  rakesh  salekar   NaN
2    rani      NaN  43.0
3     NaN   gadage  23.0

In [ ]:
# one time changes for fillna